app/Validation/UserRules.php

SELECT *
FROM `users`
WHERE `email` = 'johnmark@gmail.com'
 LIMIT 1
---
    public function validateUser(string $str, string $fields,array $data){
        $model = new UserModel();
        $user = $model->where('email', $data['email'])
                      ->first();