app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `email` = 'johnmark@gmail.com'
 LIMIT 1
---
    public function index()
    {
       $data= [];
       helper(['form']);

       if($this->request->getMethod()=='post'){
        //validation here
        $rules = [

            'email' => 'required|min_length[6]|max_length[50]|valid_email',
            'password' => 'required|min_length[8]|max_length[255]|validateUser[email,password]',

        ];
        $errors = [
            'password'=> [
                'validateUser' => 'Email or Password don\'t match',
            ]
        ];
            if(! $this -> validate($rules,$errors)){
                $data['validation'] = $this->validator;
            }
            else{

                $model = new UserModel();
                $user = $model->where('email',$this->request->getVar('email'))
                              ->first();

INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`) VALUES ('John', 'Mark', 'johnmark@gmail.com', '$2y$10$D3VzedasdewUDpeyNSqJV.Ve98LTisZAJoResRc.V0EIj.eC2mnlK')
---
    public function register(){
        $data= [];
        helper(['form']);
        if($this->request->getMethod()=='post'){
            //validation here
            $rules = [
                'firstname' =>'required|min_length[3]|max_length[50]',
                'lastname' =>'required|min_length[3]|max_length[50]',
                'email' => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[8]|max_length[255]',
                'password_confirm' => 'matches[password]',
            ];
            if(! $this -> validate($rules)){
                $data['validation'] = $this->validator;
            }
            else{
                //store user in our database
                $model = new UserModel();

                $newData = [
                    'firstname' => $this->request->getVar('firstname'),
                    'lastname' => $this->request->getVar('lastname'),
                    'email' => $this->request->getVar('email'),
                    'password' => $this->request->getVar('password'),
                ];
                $model->save($newData);